"""
다음 규칙에 맞는 구구단 게임을 구현하세요

구구단은 2단부터 9단까지 있으며, 랜덤으로 출제됩니다.
문항은 총 10문항이며, 추후 업그레이드를 통해 사용자가 원하는 횟수만큼 출제되도록 변경할 예정입니다.
프로그램이 문제를 랜덤으로 출제하면, 사용자는 입력을 통해 정답을 맞춥니다.
프로그램이 모든 문제를 출제하고 사용자가 입력을 마치고 나면, 맞춘 문제의 개수와 틀린 문제의 개수를 카운트하여 결과로 출력합니다.

구구단 문제 시작!
2 x 5 = (10)
5 x 7 = (35)
8 x 3 = (24)
9 x 2 = (18)
3 x 2 = (6)
2 x 9 = (15)
9 x 9 = (88)
6 x 1 = (6)
9 x 5 = (42)
8 x 7 = (55)
<결과>
맞춘 문제 : 6개
틀린 문제 : 4개
게임을 종료합니다.


추가 업그레이드해볼만한 내용들
(별도 풀이 없이 코드 제공 및 질문에 답변만 하겠습니다)
구구단을 1문제 맞출 때마다 10점을 획득하도록 처리
구구단을 1문제 틀릴 때마다 5점을 감점하도록 처리 (단, 점수는 0보다 작을 수 없음)
구구단을 연속으로 맞추면 콤보 시스템을 발동시켜 다음과 같이 점수를 계산하도록 처리
1개를 맞추면 10 x 1콤보 = 10점을 획득 (기존과 동일)
2개를 연속으로 맞추면 10 x 2콤보 = 20점을 획득
N개를 연속으로 맞추면 10 x N콤보에 해당하는 점수를 획득
콤보와 관계없이 틀릴 경우 5점을 감점하도록 처리
이렇게 계산된 최종 점수를 결과 화면에 같이 출력
"""

import random

correct = 0
wrong = 0
question = int(input("문제를 몇 번 풀겠습니까? : "))

score = 0
combo = 0

for i in range(question) :
    number1 = random.randint(2, 9)
    number2 = random.randint(1, 9)
    answer = number1 * number2
    print(f"문제 : {number1} x {number2} = ?")
    user = int(input("정답 입력 : "))
    if user == answer :
        correct += 1
        combo += 1
        score += 10 * combo
    else :
        wrong += 1
        score -= 5
        combo = 0
    if score < 0 :
        score = 0

print()

print("<결과>")
print(f"맞힌 문제 : {correct} 개")
print(f"틀린 문제 : {wrong} 개")
print(f"점수 : {score} 점")
print("게임을 종료합니다.")

