"""
[문제: 택배 상자 포장 프로그램]

택배를 보내려는 손님들이 있습니다.

상자 하나에는 물건을 최대 5개까지 담을 수 있습니다.

다음 조건에 맞게 프로그램을 작성하세요.

1. 손님이 몇 명인지 입력받습니다.
2. 손님 수만큼 반복하면서 각 손님의 물건 개수를 입력받습니다.
3. 상자 하나에는 물건을 최대 5개까지 담을 수 있습니다.
4. 상자 하나당 포장 비용은 1,000원입니다.
5. 손님마다 필요한 상자 수와 포장 비용을 출력합니다.
6. 모든 손님의 포장 비용을 합산하여 마지막에 출력합니다.

[실행 예시]

몇 명이 방문하나요? : 3

물건 개수 : 10
필요한 상자 : 2개
포장 비용 : 2000원

물건 개수 : 12
필요한 상자 : 3개
포장 비용 : 3000원

물건 개수 : 4
필요한 상자 : 1개
포장 비용 : 1000원

총 포장 비용 : 6000원

[사용할 개념]
- for 반복문
- if / else 조건문
- // 몫 연산자
- % 나머지 연산자
- 변수와 누적 합계
"""


guest = int(input("몇 명이 방문하나요? : "))
total = 0

for i in range(guest) :
    items = int(input("물건 개수 : "))
    box = int(items // 5)

    if items % 5 :
        box +=1

    cost = box * 1000
    total += cost

    print(f"필요한 상자 : {box} 개")
    print(f"포장비용 : {cost} 원")

print(f"총 포장비용 : {total} 원")