"""
고대 그리스에는 현명하기로 소문난 노인이 살고 있었습니다.
이 소문을 들은 왕은 궁금해서 노인을 찾아가 이렇게 말했습니다.

   뭐든 한 가지 소원을 들어줄테니 말해봐라!

노인은 자신의 탐욕을 시험하기 위해 왕이 떠보는 것이라는걸 파악하고 다음과 같이 말했습니다.

   전하.
   저는 늙어서 큰 욕심이 없습니다.
   30일동안 작은 돈 몇푼만 주시면 됩니다.

   첫날은 한닢만 주시고
   다음날부터는 전날의 두배를 주시옵소서.

이 노인이 매일같이 받게되는 금화의 개수를 출력
이 노인이 30일간 받게되는 금화의 개수를 출력
기간을 다르게 설정할 수 있도록 입력으로 변경
"""

coin = 1
total = 0
period = int(input("금화 받을 기간 : "))

for day in range(1, period+1) :
    print(f"매일 받는 금화 갯수 : {day}일차 {coin}개")
    total += coin
    coin *= 2

print("총 갯수 :", total,"개")

