"""
실습문제 : 영화관 할인 요금 계산기

영화관에서 관람객의 나이에 따라 할인율을 다르게 적용하는 프로그램을 구현하세요.
영화표의 기본 가격은 15,000원입니다.
사용자는 출생년도 4자리를 입력합니다.
계산된 나이에 따라 다음과 같이 할인율을 적용합니다.
65세 이상 : 50% 할인
20세~64세 : 할인 없음
14세~19세 : 20% 할인
8세~13세 : 40% 할인
7세 이하 : 100% 할인 (무료)

요구사항
출생년도를 입력받아 2026년 기준 한국 나이를 계산하세요.
if ~ elif ~ else를 사용하여 할인율을 결정하세요.
할인 금액을 계산하세요.
최종 결제 금액을 계산하세요.
기본 가격, 할인율, 할인 금액, 최종 결제 금액을 출력하세요.

실행 예시
출생년도(4자리) : 2010

나이 : 17세
기본 가격 : 15000원
할인율 : 20%
할인 금액 : 3000원
최종 결제 금액 : 12000원
"""

# 입력
# birth_year = int(input("출생년도(4자리) : "))  # 또는 아래 코드도 가능
birth_year = int(input("생년월일(8자리) : "))
birth_year = birth_year//10000

# 연산
age = 2026 - birth_year + 1
basic = 15000
# rate를 조건에 따라서 다르게 계산
if age >= 65 :
    rate = 50
# elif age >= 20 and age <= 64 :
elif age >= 20 :  # 65세 이상은 위에서 빠지므로 언급할 필요 X
    rate = 0
elif age >= 14 :
    rate = 20
elif age >= 8 :
    rate = 40
else :
    rate = 100

discount = int(basic * rate / 100)
ticket_price = basic - discount

# 출력

print(f"나이 : {age}세")
print(f"기본가격 : {15000}원")
print(f"할인율 : {rate}%")
print(f"할인금액 : {discount}원")
print(f"최종 결제금액 : {ticket_price}원")


